import { StyledBiography } from "./index.styled";

const Biography = () => {
  return (
    <StyledBiography>
      <h2>Biography</h2>
      <p>
        はじめまして。1995年生まれのエンジニア、菊地昇平と申します。簡単に自己紹介させて頂きます。
      </p>
      <p>
        18歳、現役で日本大学松戸歯学部歯学科に入学しました。しかし、5年在学した後にどうしても肌に合わず、自主退学。その後2年ほどパチンコ・スロットで生計を立てながら再度受験をし、東京理科大学理学部第二部数学科に入学。
      </p>
      <p>
        入学後、コロナ支援金の10万円でMacBookを購入し、プログラミング学習を友人を師としてスタート。フロントエンドエンジニアである友人の影響から、JavaScript、TypeScript、Reactを学んでおります。ありがたいことに未熟ながら、この伝手でWEBページの作成のプロジェクトに参加させてもらいました。
      </p>
      <p>
        一方で大学では、基礎数学だけでなく、情報数学の分野で、PythonやSASを使用して、データサイエンスの学習もしております。これらの経験を踏まえて、Webアプリ、スマホアプリの開発をしていきたいと考えています
      </p>
    </StyledBiography>
  );
};

export default Biography;
